<h1>CARGA Y EXPLORACIÓN INICIAL DE LA INFORMACIÓN</h1>

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import matplotlib.style as style
from datetime import datetime

###  1. Desde el df de amazon crearemos 2 tablas, una con la cabecera de las order ID y otra tabla con el detalle de los SKU, con el fin de facilitar el analisis de datos posterior.

### Primero cargamos el df limpio

In [2]:
amazon_clean = pd.read_csv("C:/Users/felip/Desktop/Master_BI_DM/Data Set/amazon_final.csv")
amazon_clean.head()

,index,Order ID,Date,Status,Fulfilment,Sales Channel,ship-service-level,Style,SKU,Category,...,Courier Status,Qty,currency,Amount,ship-state,ship-postal-code,ship-country,B2B,fulfilled-by,sub-status
0,0,405-8078784-5731545,2022-04-30,Cancelled,Merchant,Amazon.in,Standard,SET389,SET389-KR-NP-S,Set,...,NaN,0,INR,647.62,MAHARASHTRA,400081.0,IN,False,Easy Ship,NaN
1,1,171-9198151-1101146,2022-04-30,Shipped,Merchant,Amazon.in,Standard,JNE3781,JNE3781-KR-XXXL,kurta,...,Shipped,1,INR,406.00,KARNATAKA,560085.0,IN,False,Easy Ship,Delivered to Buyer
2,2,404-0687676-7273146,2022-04-30,Shipped,Amazon,Amazon.in,Expedited,JNE3371,JNE3371-KR-XL,kurta,...,Shipped,1,INR,329.00,MAHARASHTRA,410210.0,IN,True,NaN,NaN
3,3,403-9615377-8133951,2022-04-30,Cancelled,Merchant,Amazon.in,Standard,J0341,J0341-DR-L,Western Dress,...,NaN,0,INR,753.33,PUDUCHERRY,605008.0,IN,False,Easy Ship,NaN
4,4,407-1069790-7240320,2022-04-30,Shipped,Amazon,Amazon.in,Expedited,JNE3671,JNE3671-TU-XXXL,Top,...,Shipped,1,INR,574.00,TAMIL NADU,600073.0,IN,False,NaN,NaN

### Hacemos una copia para trabajar sobre ella

In [3]:
amazon_clean_copia = amazon_clean.copy()

### Visualizamos los nombres de columnas

In [4]:
amazon_clean_copia.columns

Index(['index', 'Order ID', 'Date', 'Status', 'Fulfilment', 'Sales Channel ',
       'ship-service-level', 'Style', 'SKU', 'Category', 'Size', 'ASIN',
       'Courier Status', 'Qty', 'currency', 'Amount', 'ship-state',
       'ship-postal-code', 'ship-country', 'B2B', 'fulfilled-by',
       'sub-status'],
      dtype='object')

### Eliminamos las columnas que no serán parte del df (cabecera)

In [5]:
amazon_clean_copia.drop(['index','Style', 'SKU', 'Category', 'Size', 'ASIN','Courier Status', 'Qty', 'currency', 'Amount'],axis = 'columns', inplace=True)
amazon_clean_copia.head()

,Order ID,Date,Status,Fulfilment,Sales Channel,ship-service-level,ship-state,ship-postal-code,ship-country,B2B,fulfilled-by,sub-status
0,405-8078784-5731545,2022-04-30,Cancelled,Merchant,Amazon.in,Standard,MAHARASHTRA,400081.0,IN,False,Easy Ship,NaN
1,171-9198151-1101146,2022-04-30,Shipped,Merchant,Amazon.in,Standard,KARNATAKA,560085.0,IN,False,Easy Ship,Delivered to Buyer
2,404-0687676-7273146,2022-04-30,Shipped,Amazon,Amazon.in,Expedited,MAHARASHTRA,410210.0,IN,True,NaN,NaN
3,403-9615377-8133951,2022-04-30,Cancelled,Merchant,Amazon.in,Standard,PUDUCHERRY,605008.0,IN,False,Easy Ship,NaN
4,407-1069790-7240320,2022-04-30,Shipped,Amazon,Amazon.in,Expedited,TAMIL NADU,600073.0,IN,False,NaN,NaN

### Mostramos las columnas que quedaron despues del proceso anterior.

In [6]:
amazon_clean_copia.columns

Index(['Order ID', 'Date', 'Status', 'Fulfilment', 'Sales Channel ',
       'ship-service-level', 'ship-state', 'ship-postal-code', 'ship-country',
       'B2B', 'fulfilled-by', 'sub-status'],
      dtype='object')

### Mostramos la cantidad de datos

In [7]:
amazon_clean_copia.shape

(128975, 12)

### Eliminamos las filas duplicadas

In [8]:
amazon_clean_copia = amazon_clean_copia.drop_duplicates()
amazon_clean_copia.shape

(120378, 12)

### Renombramos las columnas

In [9]:

amazon_clean_copia.rename(columns={'Order ID':'order_id','Status':'estado', 'Sales Channel ':'Sales_channel','ship-service-level':'ship_service_level','ship-state':'ship_state','ship-postal-code':'ship_postal_code','ship-country':'ship_country','fulfilled-by':'fulfilled_by','sub-status':'sub_status'}, inplace=True)

### Mostramos los datos

In [10]:
amazon_clean_copia.head()

,order_id,Date,estado,Fulfilment,Sales_channel,ship_service_level,ship_state,ship_postal_code,ship_country,B2B,fulfilled_by,sub_status
0,405-8078784-5731545,2022-04-30,Cancelled,Merchant,Amazon.in,Standard,MAHARASHTRA,400081.0,IN,False,Easy Ship,NaN
1,171-9198151-1101146,2022-04-30,Shipped,Merchant,Amazon.in,Standard,KARNATAKA,560085.0,IN,False,Easy Ship,Delivered to Buyer
2,404-0687676-7273146,2022-04-30,Shipped,Amazon,Amazon.in,Expedited,MAHARASHTRA,410210.0,IN,True,NaN,NaN
3,403-9615377-8133951,2022-04-30,Cancelled,Merchant,Amazon.in,Standard,PUDUCHERRY,605008.0,IN,False,Easy Ship,NaN
4,407-1069790-7240320,2022-04-30,Shipped,Amazon,Amazon.in,Expedited,TAMIL NADU,600073.0,IN,False,NaN,NaN

### Ya tenemos listos los datos para importar a tabla cab_amazon de la base de datos mysql.
### Creamos la conexion con mysql, base de datos tfm

In [11]:
import mysql.connector
from sqlalchemy import create_engine

In [12]:
conn = create_engine("mysql+pymysql://audytax:2904@localhost/tfm")
try:
    if conn:
        cursor = conn.connect()
        print("conexion exitosa")
except Exception as ex:
    print(ex)
finally:
    cursor.close()

conexion exitosa

In [13]:
%load_ext sql

In [14]:
%sql mysql+mysqlconnector://audytax:2904@localhost/tfm

### Verificamos que la tabla no exista en la bd tfm

In [15]:
%sql select * from cab_amazon

 * mysql+mysqlconnector://audytax:***@localhost/tfm
(mysql.connector.errors.ProgrammingError) 1146 (42S02): Table 'tfm.cab_amazon' doesn't exist
[SQL: select * from cab_amazon]
(Background on this error at: https://sqlalche.me/e/20/f405)

### Creamos la tabla cab_amazon

In [16]:
%sql CREATE TABLE `cab_amazon` (   `order_id` CHAR(50) NOT NULL DEFAULT '' COLLATE 'latin1_swedish_ci',    `Date` DATE NULL DEFAULT NULL,    `estado` VARCHAR(100) NULL DEFAULT NULL COLLATE 'latin1_swedish_ci',    `Fulfilment` VARCHAR(100) NULL DEFAULT NULL COLLATE 'latin1_swedish_ci',    `Sales_channel` VARCHAR(100) NULL DEFAULT NULL COLLATE 'latin1_swedish_ci',    `ship_service_level` VARCHAR(100) NULL DEFAULT NULL COLLATE 'latin1_swedish_ci',    `ship_state` VARCHAR(100) NULL DEFAULT NULL COLLATE 'latin1_swedish_ci',    `ship_postal_code` VARCHAR(100) NULL DEFAULT NULL COLLATE 'latin1_swedish_ci',    `ship_country` VARCHAR(100) NULL DEFAULT NULL COLLATE 'latin1_swedish_ci',    `B2B` VARCHAR(100) NULL DEFAULT NULL COLLATE 'latin1_swedish_ci',    `fulfilled_by` VARCHAR(100) NULL DEFAULT NULL COLLATE 'latin1_swedish_ci',    `sub_status` VARCHAR(100) NULL DEFAULT NULL COLLATE 'latin1_swedish_ci',    PRIMARY KEY (`order_id`) USING BTREE);

 * mysql+mysqlconnector://audytax:***@localhost/tfm
0 rows affected.

[]

### Verificamos que la tabla se haya creado.

In [17]:
%sql select * from cab_amazon

 * mysql+mysqlconnector://audytax:***@localhost/tfm
0 rows affected.

[]

### Realizamos el volcado de datos a la tabla recientemente creada.

In [18]:
amazon_clean_copia.to_sql('cab_amazon', con = conn, if_exists = 'append', index=False)

120378

### Validamos que los datos se hayan cargado

In [19]:
%sql select * from cab_amazon limit 5

 * mysql+mysqlconnector://audytax:***@localhost/tfm
5 rows affected.

[('171-0000547-8192359', datetime.date(2022, 6, 7), 'Shipped', 'Amazon', 'Amazon.in', 'Expedited', 'MAHARASHTRA', '412101', 'IN', '0', None, None),
 ('171-0000902-4490745', datetime.date(2022, 6, 9), 'Cancelled', 'Amazon', 'Amazon.in', 'Expedited', 'WEST BENGAL', '711104', 'IN', '0', None, None),
 ('171-0001409-6228339', datetime.date(2022, 6, 7), 'Shipped', 'Amazon', 'Amazon.in', 'Expedited', 'TELANGANA', '508206', 'IN', '0', None, None),
 ('171-0003082-5110755', datetime.date(2022, 5, 4), 'Shipped', 'Amazon', 'Amazon.in', 'Expedited', 'UTTAR PRADESH', '201306', 'IN', '0', None, None),
 ('171-0003738-2052324', datetime.date(2022, 4, 3), 'Shipped', 'Amazon', 'Amazon.in', 'Expedited', 'UTTAR PRADESH', '283203', 'IN', '0', None, None)]

### Ahora cargaremos los datos del detalle del df amazon_sale_report.

In [20]:
amazon_clean.head()

,index,Order ID,Date,Status,Fulfilment,Sales Channel,ship-service-level,Style,SKU,Category,...,Courier Status,Qty,currency,Amount,ship-state,ship-postal-code,ship-country,B2B,fulfilled-by,sub-status
0,0,405-8078784-5731545,2022-04-30,Cancelled,Merchant,Amazon.in,Standard,SET389,SET389-KR-NP-S,Set,...,NaN,0,INR,647.62,MAHARASHTRA,400081.0,IN,False,Easy Ship,NaN
1,1,171-9198151-1101146,2022-04-30,Shipped,Merchant,Amazon.in,Standard,JNE3781,JNE3781-KR-XXXL,kurta,...,Shipped,1,INR,406.00,KARNATAKA,560085.0,IN,False,Easy Ship,Delivered to Buyer
2,2,404-0687676-7273146,2022-04-30,Shipped,Amazon,Amazon.in,Expedited,JNE3371,JNE3371-KR-XL,kurta,...,Shipped,1,INR,329.00,MAHARASHTRA,410210.0,IN,True,NaN,NaN
3,3,403-9615377-8133951,2022-04-30,Cancelled,Merchant,Amazon.in,Standard,J0341,J0341-DR-L,Western Dress,...,NaN,0,INR,753.33,PUDUCHERRY,605008.0,IN,False,Easy Ship,NaN
4,4,407-1069790-7240320,2022-04-30,Shipped,Amazon,Amazon.in,Expedited,JNE3671,JNE3671-TU-XXXL,Top,...,Shipped,1,INR,574.00,TAMIL NADU,600073.0,IN,False,NaN,NaN

### Renombramos las columnas

In [21]:
amazon_clean.rename(columns={'Order ID': 'order_id','Courier Status':'Courier_Status'}, inplace=True)

### Creamos la tabla amazon_sale_report en la bd tfm

In [22]:
%sql CREATE TABLE `amazon_sale_report` (`index` INT(11) NOT NULL DEFAULT '0',`order_id` VARCHAR(50) NULL DEFAULT NULL COLLATE 'latin1_swedish_ci',`SKU` VARCHAR(100) NULL DEFAULT NULL COLLATE 'latin1_swedish_ci',`ASIN` VARCHAR(100) NULL DEFAULT NULL COLLATE 'latin1_swedish_ci',`Courier_Status` VARCHAR(100) NULL DEFAULT NULL COLLATE 'latin1_swedish_ci',`Qty` VARCHAR(100) NULL DEFAULT NULL COLLATE 'latin1_swedish_ci',`currency` VARCHAR(100) NULL DEFAULT NULL COLLATE 'latin1_swedish_ci',`amount` DECIMAL(10,2) NULL DEFAULT NULL,PRIMARY KEY (`index`) USING BTREE,INDEX `order_id` (`order_id`) USING BTREE)

 * mysql+mysqlconnector://audytax:***@localhost/tfm
0 rows affected.

[]

### Verificamos que la tabla se haya creado

In [23]:
%sql select * from amazon_sale_report

 * mysql+mysqlconnector://audytax:***@localhost/tfm
0 rows affected.

[]

### Realizamos el volcado de datos a la tabla amazon_sale_report

In [24]:
amazon_clean[['index','order_id',  'SKU', 'ASIN','Courier_Status', 'Qty', 'currency', 'Amount']].to_sql('amazon_sale_report', con = conn, if_exists = 'append', index=False)

128975

### Verificamos que los datos se hayan cargado correctamente

In [25]:
%sql select * from amazon_sale_report limit 5

 * mysql+mysqlconnector://audytax:***@localhost/tfm
5 rows affected.

[(0, '405-8078784-5731545', 'SET389-KR-NP-S', 'B09KXVBD7Z', None, '0', 'INR', Decimal('647.62')),
 (1, '171-9198151-1101146', 'JNE3781-KR-XXXL', 'B09K3WFS32', 'Shipped', '1', 'INR', Decimal('406.00')),
 (2, '404-0687676-7273146', 'JNE3371-KR-XL', 'B07WV4JV4D', 'Shipped', '1', 'INR', Decimal('329.00')),
 (3, '403-9615377-8133951', 'J0341-DR-L', 'B099NRCT7B', None, '0', 'INR', Decimal('753.33')),
 (4, '407-1069790-7240320', 'JNE3671-TU-XXXL', 'B098714BZP', 'Shipped', '1', 'INR', Decimal('574.00'))]

## 2. Proceso de carga International Sale Report

### Cargamos el df international_sale_report limpio

In [26]:
international = pd.read_csv("C:/Users/felip/Desktop/Master_BI_DM/Data Set/02 International sale Report_1_clean.csv")
international.head()

,index,DATE,Months,CUSTOMER,Style,SKU,Size,PCS,RATE,GROSS AMT
0,0,2021-06-05,Jun-21,REVATHY LOGANATHAN,MEN5004,MEN5004-KR-L,L,1.0,616.56,617.0
1,1,2021-06-05,Jun-21,REVATHY LOGANATHAN,MEN5004,MEN5004-KR-XL,XL,1.0,616.56,617.0
2,2,2021-06-05,Jun-21,REVATHY LOGANATHAN,MEN5004,MEN5004-KR-XXL,XXL,1.0,616.56,617.0
3,3,2021-06-05,Jun-21,REVATHY LOGANATHAN,MEN5009,MEN5009-KR-L,L,1.0,616.56,617.0
4,4,2021-06-05,Jun-21,REVATHY LOGANATHAN,MEN5011,MEN5011-KR-L,L,1.0,616.56,617.0

### Damos formato fecha a columna DATE

In [27]:
international['DATE'] = pd.to_datetime(international['DATE'])
international.dtypes

index                 int64
DATE         datetime64[ns]
Months               object
CUSTOMER             object
Style                object
SKU                  object
Size                 object
PCS                 float64
RATE                float64
GROSS AMT           float64
dtype: object

### Confirmación de cambio realizado correctamente

In [28]:
international.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17218 entries, 0 to 17217
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   index      17218 non-null  int64
 1   DATE       17218 non-null  datetime64[ns]
 2   Months     17218 non-null  object
 3   CUSTOMER   17218 non-null  object
 4   Style      17218 non-null  object
 5   SKU        17218 non-null  object
 6   Size       17218 non-null  object
 7   PCS        17218 non-null  float64
 8   RATE       17218 non-null  float64
 9   GROSS AMT  17218 non-null  float64
dtypes: datetime64[ns](1), float64(3), int64(1), object(5)
memory usage: 1.3+ MB

### Creamos la tabla international_sale_report

In [29]:
%sql CREATE TABLE `international_sale_report` (	`id` INT(11) NOT NULL DEFAULT '0',	`fecha` DATETIME NULL DEFAULT NULL,	`cliente` VARCHAR(100) NULL DEFAULT NULL COLLATE 'utf8_bin',	`sku_codigo` VARCHAR(100) NULL DEFAULT NULL COLLATE 'utf8_bin',	`cantidad` DECIMAL(10,0) NULL DEFAULT NULL,	`precio` DECIMAL(10,0) NULL DEFAULT NULL,	`precio_bruto` DECIMAL(10,0) NULL DEFAULT NULL,	PRIMARY KEY (`id`) USING BTREE)

 * mysql+mysqlconnector://audytax:***@localhost/tfm
0 rows affected.

[]

### Verificamos que la tabla se creó correctamente

In [30]:
%sql select * from international_sale_report limit 1

 * mysql+mysqlconnector://audytax:***@localhost/tfm
0 rows affected.

[]

### Renombramos las columnas del df International

In [31]:
international.rename(columns={'index': 'id','DATE':'fecha','Months':'mes','CUSTOMER':'cliente','SKU':'sku_codigo','PCS':'cantidad','RATE':'precio','GROSS AMT':'precio_bruto'}, inplace=True)

### Realizamos el volcado de datos a la tabla international_sale_report

In [32]:
international[['id','fecha','cliente','sku_codigo','cantidad','precio','precio_bruto']].to_sql('international_sale_report', con = conn, if_exists = 'append', index=False)

17218

### Verificamos que los datos se cargaron correctamente

In [33]:
%sql select * from international_sale_report limit 5

 * mysql+mysqlconnector://audytax:***@localhost/tfm
5 rows affected.

[(0, datetime.datetime(2021, 6, 5, 0, 0), bytearray(b'REVATHY LOGANATHAN'), bytearray(b'MEN5004-KR-L'), Decimal('1'), Decimal('617'), Decimal('617')),
 (1, datetime.datetime(2021, 6, 5, 0, 0), bytearray(b'REVATHY LOGANATHAN'), bytearray(b'MEN5004-KR-XL'), Decimal('1'), Decimal('617'), Decimal('617')),
 (2, datetime.datetime(2021, 6, 5, 0, 0), bytearray(b'REVATHY LOGANATHAN'), bytearray(b'MEN5004-KR-XXL'), Decimal('1'), Decimal('617'), Decimal('617')),
 (3, datetime.datetime(2021, 6, 5, 0, 0), bytearray(b'REVATHY LOGANATHAN'), bytearray(b'MEN5009-KR-L'), Decimal('1'), Decimal('617'), Decimal('617')),
 (4, datetime.datetime(2021, 6, 5, 0, 0), bytearray(b'REVATHY LOGANATHAN'), bytearray(b'MEN5011-KR-L'), Decimal('1'), Decimal('617'), Decimal('617'))]

## 3. Proceso de carga STOCK

### Cargamos el df International sale Report_Stock Limpio

In [34]:
stock = pd.read_csv("C:/Users/felip/Desktop/Master_BI_DM/Data Set/02 International sale Report_2_Stock.csv")
stock.head()

              SKU    Style Size  Stock
0    MEN5004-KR-L  MEN5004    L    8.0
1   MEN5004-KR-XL  MEN5004   XL    4.0
2  MEN5004-KR-XXL  MEN5004  XXL    6.0
3    MEN5009-KR-L  MEN5009    L    6.0
4    MEN5011-KR-L  MEN5011    L   11.0

### Verificamos la cantidad de filas y columnas

In [35]:
stock.shape

(4599, 4)

### Eliminamos las columnas Style y Size

In [36]:
stock.drop(['Style','Size'],axis = 'columns', inplace=True)

### Borramos los datos duplicados del df stock

In [37]:
stock = stock.drop_duplicates()
stock.shape

(4597, 2)

### Creamos la tabla stock en la base de datos

In [38]:
%sql CREATE TABLE `stock` (	`sku_codigo` CHAR(100) NULL DEFAULT NULL COLLATE 'latin1_swedish_ci',	`cantidad` DECIMAL(10,0) NULL DEFAULT NULL,PRIMARY KEY (`sku_codigo`) USING BTREE)

 * mysql+mysqlconnector://audytax:***@localhost/tfm
0 rows affected.

[]

### Verificamos que tabla stock se creó correctamente en la bd

In [39]:
%sql select * from stock

 * mysql+mysqlconnector://audytax:***@localhost/tfm
0 rows affected.

[]

### Renombramos las columnas del df stock para mantener consistencia con el resto de las tablas de la bd

In [40]:
stock.rename(columns={'SKU':'sku_codigo','Stock':'cantidad'}, inplace=True)

### Realizamos el volcado de datos a la tabla stock

In [41]:
stock[['sku_codigo','cantidad',]].to_sql('stock', con = conn, if_exists = 'append', index=False)

4597

### Verificamos que los datos se cargaron correctamente.

In [42]:
%sql select * from stock limit 5

 * mysql+mysqlconnector://audytax:***@localhost/tfm
5 rows affected.

[('AN202-ORANGE-L', Decimal('14')),
 ('AN202-ORANGE-M', Decimal('8')),
 ('AN202-ORANGE-S', Decimal('20')),
 ('AN202-ORANGE-XL', Decimal('13')),
 ('AN202-ORANGE-XXL', Decimal('24'))]

## 4. Cargar Marzo 2021

### Cargamos el df pl march 2021 limpio

In [43]:
pl_marzo = pd.read_excel("C:/Users/felip/Desktop/Master_BI_DM/Data Set/P_L_MARCH_CLEAN.xlsx")
pl_marzo.head()

,index,Sku,Style Id,Catalog,Category,Weight,TP 1,TP 2,MRP Old,Final MRP Old,Ajio MRP,Amazon MRP,Amazon FBA MRP,Flipkart MRP,Limeroad MRP,Myntra MRP,Paytm MRP,Snapdeal MRP,Custom_Size
0,0,Os206_3141_S,Os206_3141,Moments,Kurta,0.3,538,435.78,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295,S
1,1,Os206_3141_M,Os206_3141,Moments,Kurta,0.3,538,435.78,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295,M
2,2,Os206_3141_L,Os206_3141,Moments,Kurta,0.3,538,435.78,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295,L
3,3,Os206_3141_XL,Os206_3141,Moments,Kurta,0.3,538,435.78,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295,XL
4,4,Os206_3141_2XL,Os206_3141,Moments,Kurta,0.3,538,435.78,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295,2XL

### Revisamos el nombre de las columnas de df

In [44]:
pl_marzo.columns

Index(['index', 'Sku', 'Style Id', 'Catalog', 'Category', 'Weight', 'TP 1',
       'TP 2', 'MRP Old', 'Final MRP Old', 'Ajio MRP', 'Amazon MRP',
       'Amazon FBA MRP', 'Flipkart MRP', 'Limeroad MRP', 'Myntra MRP',
       'Paytm MRP', 'Snapdeal MRP', 'Custom_Size'],
      dtype='object')

### Renombramos las columnas, quitando los espacios y dejando los nombres como los otros df

In [45]:
pl_marzo.rename(columns={'index':'id','Style Id':'style', 'Category':'categoria', 'TP 1':'TP_1','TP 2':'TP_2', 'MRP Old':'MRP_Old', 'Final MRP Old':'Final_MRP_Old', 'Ajio MRP':'Ajio_MRP', 'Amazon MRP':'Amazon_MRP','Amazon FBA MRP':'Amazon_FBA_MRP', 'Flipkart MRP':'Flipkart_MRP', 'Limeroad MRP':'Limeroad_MRP', 'Myntra MRP':'Myntra_MRP','Paytm MRP':'Paytm_MRP', 'Snapdeal MRP':'Snapdeal_MRP', 'Custom_Size':'Size'}, inplace=True)
pl_marzo.head()

,id,Sku,style,Catalog,categoria,Weight,TP_1,TP_2,MRP_Old,Final_MRP_Old,Ajio_MRP,Amazon_MRP,Amazon_FBA_MRP,Flipkart_MRP,Limeroad_MRP,Myntra_MRP,Paytm_MRP,Snapdeal_MRP,Size
0,0,Os206_3141_S,Os206_3141,Moments,Kurta,0.3,538,435.78,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295,S
1,1,Os206_3141_M,Os206_3141,Moments,Kurta,0.3,538,435.78,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295,M
2,2,Os206_3141_L,Os206_3141,Moments,Kurta,0.3,538,435.78,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295,L
3,3,Os206_3141_XL,Os206_3141,Moments,Kurta,0.3,538,435.78,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295,XL
4,4,Os206_3141_2XL,Os206_3141,Moments,Kurta,0.3,538,435.78,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295,2XL

### Revisamos que la tabla pl_marzo no exista.

In [46]:
%sql select * from pl_marzo limit 5

 * mysql+mysqlconnector://audytax:***@localhost/tfm
(mysql.connector.errors.ProgrammingError) 1146 (42S02): Table 'tfm.pl_marzo' doesn't exist
[SQL: select * from pl_marzo limit 5]
(Background on this error at: https://sqlalche.me/e/20/f405)

### Creamos la tabla pl_marzo en la bd

In [47]:
%sql CREATE TABLE `pl_marzo` (	`id` INT(11) NULL DEFAULT NULL,	`Sku` CHAR(50) NULL DEFAULT NULL COLLATE 'utf8_swedish_ci',	`style` CHAR(50) NULL DEFAULT NULL COLLATE 'utf8_swedish_ci',	`Catalog` CHAR(50) NULL DEFAULT NULL COLLATE 'utf8_swedish_ci',	`categoria` CHAR(50) NULL DEFAULT NULL COLLATE 'utf8_swedish_ci',	`Weight` DECIMAL(20,6) NULL DEFAULT NULL,	`TP_1` DECIMAL(20,6) NULL DEFAULT NULL,	`TP_2` DECIMAL(20,6) NULL DEFAULT NULL,	`MRP_Old` DECIMAL(20,6) NULL DEFAULT NULL,	`Final_MRP_Old` DECIMAL(20,6) NULL DEFAULT NULL,	`Ajio_MRP` DECIMAL(20,6) NULL DEFAULT NULL,	`Amazon_MRP` DECIMAL(20,6) NULL DEFAULT NULL,	`Amazon_FBA_MRP` DECIMAL(20,6) NULL DEFAULT NULL,	`Flipkart_MRP` DECIMAL(20,6) NULL DEFAULT NULL,	`Limeroad_MRP` DECIMAL(20,6) NULL DEFAULT NULL,	`Myntra_MRP` DECIMAL(20,6) NULL DEFAULT NULL,	`Paytm_MRP` DECIMAL(20,6) NULL DEFAULT NULL,	`Snapdeal_MRP` DECIMAL(20,6) NULL DEFAULT NULL,	`Size` CHAR(50) NULL DEFAULT NULL COLLATE 'utf8_swedish_ci',	PRIMARY KEY (`Sku`) USING BTREE)

 * mysql+mysqlconnector://audytax:***@localhost/tfm
0 rows affected.

[]

### Verificamos que la tabla pl_marzo se creó correctamente.

In [48]:
%sql select * from pl_marzo limit 5

 * mysql+mysqlconnector://audytax:***@localhost/tfm
0 rows affected.

[]

### Volcado de datos

In [49]:
pl_marzo.to_sql('pl_marzo', con = conn, if_exists = 'append', index=False)

1221

### Verifica carga

In [50]:
%sql select * from pl_marzo limit 5

 * mysql+mysqlconnector://audytax:***@localhost/tfm
5 rows affected.

[(430, 'Os102_14255_2XL', 'Os102_14255', 'Mix', 'Kurta', Decimal('0.300000'), Decimal('381.000000'), Decimal('308.610000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), '2XL'),
 (431, 'Os102_14255_3XL', 'Os102_14255', 'Mix', 'Kurta', Decimal('0.300000'), Decimal('381.000000'), Decimal('308.610000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), '3XL'),
 (428, 'Os102_14255_L', 'Os102_14255', 'Mix', 'Kurta', Decimal('0.300000'), Decimal('381.000000'), Decimal('308.610000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), 'L'),
 (427, 'Os102_14255_M', 'Os102_14255', 'Mix', 'Kurta', Decimal('0.300000'), Decimal('381.000000'), Decimal('308.610000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), 'M'),
 (426, 'Os102_14255_S', 'Os102_14255', 'Mix', 'Kurta', Decimal('0.300000'), Decimal('381.000000'), Decimal('308.610000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), Decimal('1595.000000'), 'S')]

## 5. Importación de archivo Sale Report

### Cargamos el df sale_report limpio

In [51]:
sale_report = pd.read_csv("C:/Users/felip/Desktop/Master_BI_DM/Data Set/sales_report_clean.csv")
sale_report.head()

   Unnamed: 0       SKU Code Design Code  Stock       Category Size Color
0           0    AN201-RED-L       AN201    5.0  AN : LEGGINGS    L   Red
1           1    AN201-RED-M       AN201    5.0  AN : LEGGINGS    M   Red
2           2    AN201-RED-S       AN201    3.0  AN : LEGGINGS    S   Red
3           3   AN201-RED-XL       AN201    6.0  AN : LEGGINGS   XL   Red
4           4  AN201-RED-XXL       AN201    3.0  AN : LEGGINGS  XXL   Red

### Revisamos el nombre de las columnas

In [52]:
sale_report.columns

Index(['Unnamed: 0', 'SKU Code', 'Design Code', 'Stock', 'Category', 'Size',
       'Color'],
      dtype='object')

### Renombramos las columnas para mantener consistencia con las otras tablas de la bd

In [53]:
sale_report.rename(columns={'Unnamed: 0':'id', 'SKU Code':'Sku', 'Design Code':'Style'}, inplace=True)
sale_report.head()

   id            Sku  Style  Stock       Category Size Color
0   0    AN201-RED-L  AN201    5.0  AN : LEGGINGS    L   Red
1   1    AN201-RED-M  AN201    5.0  AN : LEGGINGS    M   Red
2   2    AN201-RED-S  AN201    3.0  AN : LEGGINGS    S   Red
3   3   AN201-RED-XL  AN201    6.0  AN : LEGGINGS   XL   Red
4   4  AN201-RED-XXL  AN201    3.0  AN : LEGGINGS  XXL   Red

### Creamos la tabla sale_report en la bd

In [54]:
%sql CREATE TABLE `sale_report` (	`id` INT(11) NULL DEFAULT NULL,	`Sku` CHAR(50) NULL DEFAULT NULL COLLATE 'utf8_spanish_ci',	`Style` CHAR(50) NULL DEFAULT NULL COLLATE 'utf8_spanish_ci',	`Stock` DECIMAL(20,2) NULL DEFAULT NULL,	`Category` CHAR(50) NULL DEFAULT NULL COLLATE 'utf8_spanish_ci',	`Size` CHAR(50) NULL DEFAULT NULL COLLATE 'utf8_spanish_ci',	`Color` CHAR(50) NULL DEFAULT NULL COLLATE 'utf8_spanish_ci',PRIMARY KEY (`id`) USING BTREE)

 * mysql+mysqlconnector://audytax:***@localhost/tfm
0 rows affected.

[]

### Verificamos que la tabla se creó correctamente.

In [55]:
%sql select * from sale_report

 * mysql+mysqlconnector://audytax:***@localhost/tfm
0 rows affected.

[]

### Realizamos el volcado de datos a la tabla sale_report de la bd

In [56]:
sale_report.to_sql('sale_report', con = conn, if_exists = 'append', index=False)

9188

### Verificamos que se ha realizado el volcado correctamente.

In [57]:
%sql select * from sale_report limit 5

 * mysql+mysqlconnector://audytax:***@localhost/tfm
5 rows affected.

[(0, 'AN201-RED-L', 'AN201', Decimal('5.00'), 'AN : LEGGINGS', 'L', 'Red'),
 (1, 'AN201-RED-M', 'AN201', Decimal('5.00'), 'AN : LEGGINGS', 'M', 'Red'),
 (2, 'AN201-RED-S', 'AN201', Decimal('3.00'), 'AN : LEGGINGS', 'S', 'Red'),
 (3, 'AN201-RED-XL', 'AN201', Decimal('6.00'), 'AN : LEGGINGS', 'XL', 'Red'),
 (4, 'AN201-RED-XXL', 'AN201', Decimal('3.00'), 'AN : LEGGINGS', 'XXL', 'Red')]

## 6. Crear listado de SKU

### Cargamos los df que serviran de base para crear la tabla SKU

In [58]:
amazon_clean_sku = pd.read_csv("C:/Users/felip/Desktop/Master_BI_DM/Data Set/amazon_final.csv")
international_sku = pd.read_csv("C:/Users/felip/Desktop/Master_BI_DM/Data Set/02 International sale Report_1_clean.csv")
pl_marzo_sku = pd.read_excel("C:/Users/felip/Desktop/Master_BI_DM/Data Set/P_L_MARCH_CLEAN.xlsx")
sale_report_sku = pd.read_csv("C:/Users/felip/Desktop/Master_BI_DM/Data Set/sales_report_clean.csv")

### Comenzamos por Amazon. Mostramos las columnas

In [59]:
amazon_clean_sku.columns

Index(['index', 'Order ID', 'Date', 'Status', 'Fulfilment', 'Sales Channel ',
       'ship-service-level', 'Style', 'SKU', 'Category', 'Size', 'ASIN',
       'Courier Status', 'Qty', 'currency', 'Amount', 'ship-state',
       'ship-postal-code', 'ship-country', 'B2B', 'fulfilled-by',
       'sub-status'],
      dtype='object')

### Eliminamos las columnas que no usaremos.

In [60]:
amazon_clean_sku.drop(['index', 'Order ID', 'Date', 'Status', 'Fulfilment', 'Sales Channel ',
       'ship-service-level', 'ASIN',
       'Courier Status', 'Qty', 'currency', 'Amount', 'ship-state',
       'ship-postal-code', 'ship-country', 'B2B', 'fulfilled-by',
       'sub-status'],axis = 'columns', inplace=True)
amazon_clean_sku.head()

     Style              SKU       Category Size
0   SET389   SET389-KR-NP-S            Set    S
1  JNE3781  JNE3781-KR-XXXL          kurta  3XL
2  JNE3371    JNE3371-KR-XL          kurta   XL
3    J0341       J0341-DR-L  Western Dress    L
4  JNE3671  JNE3671-TU-XXXL            Top  3XL

### Reordenamos las columnas y agregamos las columnas que faltan para completar: SKU, Style, Category, Size y Color

In [61]:
amazon_clean_sku = amazon_clean_sku.reindex(['SKU','Style','Category','Size','Color'], axis=1) 
amazon_clean_sku

                    SKU    Style       Category Size  Color
0        SET389-KR-NP-S   SET389            Set    S    NaN
1       JNE3781-KR-XXXL  JNE3781          kurta  3XL    NaN
2         JNE3371-KR-XL  JNE3371          kurta   XL    NaN
3            J0341-DR-L    J0341  Western Dress    L    NaN
4       JNE3671-TU-XXXL  JNE3671            Top  3XL    NaN
...                 ...      ...            ...  ...    ...
128970    JNE3697-KR-XL  JNE3697          kurta   XL    NaN
128971   SET401-KR-NP-M   SET401            Set    M    NaN
128972     J0157-DR-XXL    J0157  Western Dress  XXL    NaN
128973     J0012-SKD-XS    J0012            Set   XS    NaN
128974      J0003-SET-S    J0003            Set    S    NaN

[128975 rows x 5 columns]

### Grabar archivo sku_amazon.csv

In [62]:
ruta_csv = "C:/Users/felip/Desktop/Master_BI_DM/Data Set/sku/sku_amazon.csv"
amazon_clean_sku.to_csv(ruta_csv, index=False)

### Seguimos con el archivo International. Mostramos los datos para comenzar a limpiar.

In [63]:
international_sku.head()

,index,DATE,Months,CUSTOMER,Style,SKU,Size,PCS,RATE,GROSS AMT
0,0,2021-06-05,Jun-21,REVATHY LOGANATHAN,MEN5004,MEN5004-KR-L,L,1.0,616.56,617.0
1,1,2021-06-05,Jun-21,REVATHY LOGANATHAN,MEN5004,MEN5004-KR-XL,XL,1.0,616.56,617.0
2,2,2021-06-05,Jun-21,REVATHY LOGANATHAN,MEN5004,MEN5004-KR-XXL,XXL,1.0,616.56,617.0
3,3,2021-06-05,Jun-21,REVATHY LOGANATHAN,MEN5009,MEN5009-KR-L,L,1.0,616.56,617.0
4,4,2021-06-05,Jun-21,REVATHY LOGANATHAN,MEN5011,MEN5011-KR-L,L,1.0,616.56,617.0

### Eliminamos las columnas que no vamos a necesitar.

In [64]:
international_sku.drop(['index','DATE','Months','CUSTOMER','PCS','RATE','GROSS AMT'],axis = 'columns', inplace=True)
international_sku.head()

     Style             SKU Size
0  MEN5004    MEN5004-KR-L    L
1  MEN5004   MEN5004-KR-XL   XL
2  MEN5004  MEN5004-KR-XXL  XXL
3  MEN5009    MEN5009-KR-L    L
4  MEN5011    MEN5011-KR-L    L

### Reordenamos las columnas y agregamos las que faltan.

In [65]:
international_sku = international_sku.reindex(['SKU','Style','Category','Size','Color'], axis=1) 
international_sku

                   SKU     Style  Category Size  Color
0         MEN5004-KR-L   MEN5004       NaN    L    NaN
1        MEN5004-KR-XL   MEN5004       NaN   XL    NaN
2       MEN5004-KR-XXL   MEN5004       NaN  XXL    NaN
3         MEN5009-KR-L   MEN5009       NaN    L    NaN
4         MEN5011-KR-L   MEN5011       NaN    L    NaN
...                ...       ...       ...  ...    ...
17213   SET276-KR-PP-L    SET276       NaN    L    NaN
17214  PJNE3423-KR-4XL  PJNE3423       NaN  4XL    NaN
17215  PJNE3404-KR-4XL  PJNE3404       NaN  4XL    NaN
17216  PJNE3423-KR-4XL  PJNE3423       NaN  4XL    NaN
17217  SET290-KR-DPT-M    SET290       NaN    M    NaN

[17218 rows x 5 columns]

### Grabar archivo sku_international.csv

In [66]:
ruta_csv = "C:/Users/felip/Desktop/Master_BI_DM/Data Set/sku/sku_international.csv"
international_sku.to_csv(ruta_csv, index=False)

### Continuamos con el archivo pl_marzo. Mostramos los datos para comenzar con la limpieza.

In [67]:
pl_marzo_sku.head()

,index,Sku,Style Id,Catalog,Category,Weight,TP 1,TP 2,MRP Old,Final MRP Old,Ajio MRP,Amazon MRP,Amazon FBA MRP,Flipkart MRP,Limeroad MRP,Myntra MRP,Paytm MRP,Snapdeal MRP,Custom_Size
0,0,Os206_3141_S,Os206_3141,Moments,Kurta,0.3,538,435.78,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295,S
1,1,Os206_3141_M,Os206_3141,Moments,Kurta,0.3,538,435.78,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295,M
2,2,Os206_3141_L,Os206_3141,Moments,Kurta,0.3,538,435.78,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295,L
3,3,Os206_3141_XL,Os206_3141,Moments,Kurta,0.3,538,435.78,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295,XL
4,4,Os206_3141_2XL,Os206_3141,Moments,Kurta,0.3,538,435.78,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295,2XL

### Mostramos el nombre de las columnas

In [68]:
pl_marzo_sku.columns

Index(['index', 'Sku', 'Style Id', 'Catalog', 'Category', 'Weight', 'TP 1',
       'TP 2', 'MRP Old', 'Final MRP Old', 'Ajio MRP', 'Amazon MRP',
       'Amazon FBA MRP', 'Flipkart MRP', 'Limeroad MRP', 'Myntra MRP',
       'Paytm MRP', 'Snapdeal MRP', 'Custom_Size'],
      dtype='object')

### Eliminamos las columnas que no necesitamos

In [69]:
pl_marzo_sku.drop([ 'index', 'Catalog',  'Weight', 'TP 1',
       'TP 2', 'MRP Old', 'Final MRP Old', 'Ajio MRP', 'Amazon MRP',
       'Amazon FBA MRP', 'Flipkart MRP', 'Limeroad MRP', 'Myntra MRP',
       'Paytm MRP', 'Snapdeal MRP'],axis = 'columns', inplace=True)
pl_marzo_sku.head()

              Sku    Style Id Category Custom_Size
0    Os206_3141_S  Os206_3141    Kurta           S
1    Os206_3141_M  Os206_3141    Kurta           M
2    Os206_3141_L  Os206_3141    Kurta           L
3   Os206_3141_XL  Os206_3141    Kurta          XL
4  Os206_3141_2XL  Os206_3141    Kurta         2XL

### Renombramos las columnas para mantener la estructura que necesitamos.

In [70]:
pl_marzo_sku.rename(columns={'Sku':'SKU','Style Id':'Style','Custom_Size':'Size'}, inplace=True)
pl_marzo_sku.head()

              SKU       Style Category Size
0    Os206_3141_S  Os206_3141    Kurta    S
1    Os206_3141_M  Os206_3141    Kurta    M
2    Os206_3141_L  Os206_3141    Kurta    L
3   Os206_3141_XL  Os206_3141    Kurta   XL
4  Os206_3141_2XL  Os206_3141    Kurta  2XL

### Reordenamos las columnas y agregamos la columna Color.

In [71]:
pl_marzo_sku = pl_marzo_sku.reindex(['SKU','Style','Category','Size','Color'], axis=1) 
pl_marzo_sku

                 SKU       Style Category Size  Color
0       Os206_3141_S  Os206_3141    Kurta    S    NaN
1       Os206_3141_M  Os206_3141    Kurta    M    NaN
2       Os206_3141_L  Os206_3141    Kurta    L    NaN
3      Os206_3141_XL  Os206_3141    Kurta   XL    NaN
4     Os206_3141_2XL  Os206_3141    Kurta  2XL    NaN
...              ...         ...      ...  ...    ...
1216         Os326_M       Os326    Kurta    M    NaN
1217         Os326_L       Os326    Kurta    L    NaN
1218        Os326_XL       Os326    Kurta   XL    NaN
1219       Os326_2XL       Os326    Kurta  2XL    NaN
1220       Os326_3XL       Os326    Kurta  3XL    NaN

[1221 rows x 5 columns]

### Grabar archivo sku_marzo.csv

In [72]:
ruta_csv = "C:/Users/felip/Desktop/Master_BI_DM/Data Set/sku/sku_marzo.csv"
pl_marzo_sku.to_csv(ruta_csv, index=False)

### El último archivo a crear proviene del sale_report. Mostramos los datos para conocer lo que tenemos que eliminar.

In [73]:
sale_report_sku.head()

   Unnamed: 0       SKU Code Design Code  Stock       Category Size Color
0           0    AN201-RED-L       AN201    5.0  AN : LEGGINGS    L   Red
1           1    AN201-RED-M       AN201    5.0  AN : LEGGINGS    M   Red
2           2    AN201-RED-S       AN201    3.0  AN : LEGGINGS    S   Red
3           3   AN201-RED-XL       AN201    6.0  AN : LEGGINGS   XL   Red
4           4  AN201-RED-XXL       AN201    3.0  AN : LEGGINGS  XXL   Red

### Renombramos las columnas para mentener consistencia con estructura establecida para la tabla SKU.

In [74]:
sale_report_sku.rename(columns={'Unnamed: 0':'id','SKU Code':'SKU','Design Code':'Style'}, inplace=True)
sale_report_sku.head()

   id            SKU  Style  Stock       Category Size Color
0   0    AN201-RED-L  AN201    5.0  AN : LEGGINGS    L   Red
1   1    AN201-RED-M  AN201    5.0  AN : LEGGINGS    M   Red
2   2    AN201-RED-S  AN201    3.0  AN : LEGGINGS    S   Red
3   3   AN201-RED-XL  AN201    6.0  AN : LEGGINGS   XL   Red
4   4  AN201-RED-XXL  AN201    3.0  AN : LEGGINGS  XXL   Red

### Eliminamos las columnas que no usaremos.

In [75]:
sale_report_sku.drop([ 'id','Stock'],axis = 'columns', inplace=True)
sale_report_sku.head()

             SKU  Style       Category Size Color
0    AN201-RED-L  AN201  AN : LEGGINGS    L   Red
1    AN201-RED-M  AN201  AN : LEGGINGS    M   Red
2    AN201-RED-S  AN201  AN : LEGGINGS    S   Red
3   AN201-RED-XL  AN201  AN : LEGGINGS   XL   Red
4  AN201-RED-XXL  AN201  AN : LEGGINGS  XXL   Red

### Reordemanos las columnas. en este caso no agregamos ninguna ya que están todas las que necesitamos.

In [76]:
sale_report_sku = sale_report_sku.reindex(['SKU','Style','Category','Size','Color'], axis=1) 
sale_report_sku

                    SKU   Style       Category  Size Color
0           AN201-RED-L   AN201  AN : LEGGINGS     L   Red
1           AN201-RED-M   AN201  AN : LEGGINGS     M   Red
2           AN201-RED-S   AN201  AN : LEGGINGS     S   Red
3          AN201-RED-XL   AN201  AN : LEGGINGS    XL   Red
4         AN201-RED-XXL   AN201  AN : LEGGINGS   XXL   Red
...                 ...     ...            ...   ...   ...
9183     SET462-KR-NP-S  SET462            SET     S  Teal
9184    SET462-KR-NP-XL  SET462            SET    XL  Teal
9185    SET462-KR-NP-XS  SET462            SET    XS  Teal
9186   SET462-KR-NP-XXL  SET462            SET   XXL  Teal
9187  SET462-KR-NP-XXXL  SET462            SET  XXXL  Teal

[9188 rows x 5 columns]

### Grabar archivo sku_sale_report

In [77]:
ruta_csv = "C:/Users/felip/Desktop/Master_BI_DM/Data Set/sku/sku_sale_report.csv"
sale_report_sku.to_csv(ruta_csv, index=False)

### Finalmente, creamos un solo archivo a partir de los 4 generados anteriormente. Unimos todos los csv en un df

In [106]:
import os
import pandas as pd

# Ruta de la carpeta que contiene los archivos CSV
carpeta = 'C:/Users/felip/Desktop/Master_BI_DM/Data Set/sku'

# Lista para almacenar los DataFrames de cada archivo CSV
dataframes = []

# Itera sobre cada archivo en la carpeta
for archivo in os.listdir(carpeta):
    if archivo.endswith('.csv'):
        # Construye la ruta completa del archivo
        ruta_completa = os.path.join(carpeta, archivo)
        
        # Lee el archivo CSV y lo agrega a la lista
        df = pd.read_csv(ruta_completa)
        dataframes.append(df)

# Combina todos los DataFrames en uno solo
df_final = pd.concat(dataframes, ignore_index=True)

# Muestra el DataFrame resultante
print(df_final)

                      SKU    Style       Category  Size Color
0          SET389-KR-NP-S   SET389            Set     S   NaN
1         JNE3781-KR-XXXL  JNE3781          kurta   3XL   NaN
2           JNE3371-KR-XL  JNE3371          kurta    XL   NaN
3              J0341-DR-L    J0341  Western Dress     L   NaN
4         JNE3671-TU-XXXL  JNE3671            Top   3XL   NaN
...                   ...      ...            ...   ...   ...
156597     SET462-KR-NP-S   SET462            SET     S  Teal
156598    SET462-KR-NP-XL   SET462            SET    XL  Teal
156599    SET462-KR-NP-XS   SET462            SET    XS  Teal
156600   SET462-KR-NP-XXL   SET462            SET   XXL  Teal
156601  SET462-KR-NP-XXXL   SET462            SET  XXXL  Teal

[156602 rows x 5 columns]

### Mostramos los ultimos datos cargados

In [107]:
df_final.tail()

                      SKU   Style Category  Size Color
156597     SET462-KR-NP-S  SET462      SET     S  Teal
156598    SET462-KR-NP-XL  SET462      SET    XL  Teal
156599    SET462-KR-NP-XS  SET462      SET    XS  Teal
156600   SET462-KR-NP-XXL  SET462      SET   XXL  Teal
156601  SET462-KR-NP-XXXL  SET462      SET  XXXL  Teal

### Consultamos la cantidad de filas y columnas del df

In [108]:
df_final.shape

(156602, 5)

### Borramos los datos duplicados

In [115]:
df_final = df.drop_duplicates(subset=["SKU"])

df_final.shape

(9170, 5)

### Creamos la tabla SKU en la bd

In [113]:
%sql CREATE TABLE `sku` (	`SKU` CHAR(50) NOT NULL DEFAULT '' COLLATE 'utf8_spanish_ci',	`Style` VARCHAR(100) NULL DEFAULT NULL COLLATE 'utf8_spanish_ci',	`Category` VARCHAR(100) NULL DEFAULT NULL COLLATE 'utf8_spanish_ci',	`Size` VARCHAR(100) NULL DEFAULT NULL COLLATE 'utf8_spanish_ci',	`Color` VARCHAR(100) NULL DEFAULT NULL COLLATE 'utf8_spanish_ci',	PRIMARY KEY (`SKU`) USING BTREE)

 * mysql+mysqlconnector://audytax:***@localhost/tfm
0 rows affected.

[]

### Realizamos el volcado de datos a la tabla SKU

In [116]:
df_final.to_sql('sku', con = conn, if_exists = 'append', index=False)

9170

### Verificamos que los datos se cargaron correctamente.

In [117]:
%sql select * from sku limit 5

 * mysql+mysqlconnector://audytax:***@localhost/tfm
5 rows affected.

[('#REF!', 'BL006', 'BLOUSE', 'FREE', 'Black'),
 ('AN201-RED-L', 'AN201', 'AN : LEGGINGS', 'L', 'Red'),
 ('AN201-RED-M', 'AN201', 'AN : LEGGINGS', 'M', 'Red'),
 ('AN201-RED-S', 'AN201', 'AN : LEGGINGS', 'S', 'Red'),
 ('AN201-RED-XL', 'AN201', 'AN : LEGGINGS', 'XL', 'Red')]

# FIN